placewang/HCF460/G294_PROJECT/PRO_APP/example/pro/inout/MDK/startup_hc32f46x11111.s
; Reset Handler

Reset_Handler   PROC
                EXPORT  Reset_Handler             [WEAK]
                IMPORT  SystemInit
                IMPORT  __main
               ;reset NVIC if in rom debug
                LDR     R0, =0x20000000
                LDR     R2, =Vector_App
                MOVS    R1, #0                 ; for warning,
                ADD     R1, PC,#0              ; for A1609W,
                CMP     R1, R0
                BLS     RAMCODE

              ; ram code base address.
                ADD     R2, R0,R2
RAMCODE
              ; reset Vector table address.
                LDR     R0, =0xE000ED08
                STR     R2, [R0]
                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__main
                BX      R0
                ENDP

; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler     PROC
                EXPORT  NMI_Handler               [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler         [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler         [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler          [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler        [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler               [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler          [WEAK]
                B       .
                ENDP
PendSV_Handler\
                PROC
                EXPORT  PendSV_Handler            [WEAK]
                B       .
                ENDP
SysTick_Handler\
                PROC
                EXPORT  SysTick_Handler           [WEAK]
                B       .
                ENDP

Default_Handler PROC
                EXPORT  IRQ000_Handler        [WEAK]
                EXPORT  IRQ001_Handler        [WEAK]
                EXPORT  IRQ002_Handler        [WEAK]
                EXPORT  IRQ003_Handler        [WEAK]
                EXPORT  IRQ004_Handler        [WEAK]
                EXPORT  IRQ005_Handler        [WEAK]
                EXPORT  IRQ006_Handler        [WEAK]
                EXPORT  IRQ007_Handler        [WEAK]
                EXPORT  IRQ008_Handler        [WEAK]
                EXPORT  IRQ009_Handler        [WEAK]
                EXPORT  IRQ010_Handler        [WEAK]
                EXPORT  IRQ011_Handler        [WEAK]
                EXPORT  IRQ012_Handler        [WEAK]
                EXPORT  IRQ013_Handler        [WEAK]
                EXPORT  IRQ014_Handler        [WEAK]
                EXPORT  IRQ015_Handler        [WEAK]
                EXPORT  IRQ016_Handler        [WEAK]
                EXPORT  IRQ017_Handler        [WEAK]
                EXPORT  IRQ018_Handler        [WEAK]
                EXPORT  IRQ019_Handler        [WEAK]
                EXPORT  IRQ020_Handler        [WEAK]
                EXPORT  IRQ021_Handler        [WEAK]
                EXPORT  IRQ022_Handler        [WEAK]
                EXPORT  IRQ023_Handler        [WEAK]
                EXPORT  IRQ024_Handler        [WEAK]
                EXPORT  IRQ025_Handler        [WEAK]
                EXPORT  IRQ026_Handler        [WEAK]
                EXPORT  IRQ027_Handler        [WEAK]
                EXPORT  IRQ028_Handler        [WEAK]
                EXPORT  IRQ029_Handler        [WEAK]
                EXPORT  IRQ030_Handler        [WEAK]
                EXPORT  IRQ031_Handler        [WEAK]
                EXPORT  IRQ032_Handler        [WEAK]
                EXPORT  IRQ033_Handler        [WEAK]
                EXPORT  IRQ034_Handler        [WEAK]
                EXPORT  IRQ035_Handler        [WEAK]
                EXPORT  IRQ036_Handler        [WEAK]
                EXPORT  IRQ037_Handler        [WEAK]
                EXPORT  IRQ038_Handler        [WEAK]
                EXPORT  IRQ039_Handler        [WEAK]
                EXPORT  IRQ040_Handler        [WEAK]
                EXPORT  IRQ041_Handler        [WEAK]
                EXPORT  IRQ042_Handler        [WEAK]
                EXPORT  IRQ043_Handler        [WEAK]
                EXPORT  IRQ044_Handler        [WEAK]
                EXPORT  IRQ045_Handler        [WEAK]
                EXPORT  IRQ046_Handler        [WEAK]
                EXPORT  IRQ047_Handler        [WEAK]
                EXPORT  IRQ048_Handler        [WEAK]
                EXPORT  IRQ049_Handler        [WEAK]
                EXPORT  IRQ050_Handler        [WEAK]
                EXPORT  IRQ051_Handler        [WEAK]
                EXPORT  IRQ052_Handler        [WEAK]
                EXPORT  IRQ053_Handler        [WEAK]
                EXPORT  IRQ054_Handler        [WEAK]
                EXPORT  IRQ055_Handler        [WEAK]
                EXPORT  IRQ056_Handler        [WEAK]
                EXPORT  IRQ057_Handler        [WEAK]
                EXPORT  IRQ058_Handler        [WEAK]
                EXPORT  IRQ059_Handler        [WEAK]
                EXPORT  IRQ060_Handler        [WEAK]
                EXPORT  IRQ061_Handler        [WEAK]
                EXPORT  IRQ062_Handler        [WEAK]
                EXPORT  IRQ063_Handler        [WEAK]
                EXPORT  IRQ064_Handler        [WEAK]
                EXPORT  IRQ065_Handler        [WEAK]
                EXPORT  IRQ066_Handler        [WEAK]
                EXPORT  IRQ067_Handler        [WEAK]
                EXPORT  IRQ068_Handler        [WEAK]
                EXPORT  IRQ069_Handler        [WEAK]
                EXPORT  IRQ070_Handler        [WEAK]
                EXPORT  IRQ071_Handler        [WEAK]
                EXPORT  IRQ072_Handler        [WEAK]
                EXPORT  IRQ073_Handler        [WEAK]
                EXPORT  IRQ074_Handler        [WEAK]
                EXPORT  IRQ075_Handler        [WEAK]
                EXPORT  IRQ076_Handler        [WEAK]
                EXPORT  IRQ077_Handler        [WEAK]
                EXPORT  IRQ078_Handler        [WEAK]
                EXPORT  IRQ079_Handler        [WEAK]
                EXPORT  IRQ080_Handler        [WEAK]
                EXPORT  IRQ081_Handler        [WEAK]
                EXPORT  IRQ082_Handler        [WEAK]
                EXPORT  IRQ083_Handler        [WEAK]
                EXPORT  IRQ084_Handler        [WEAK]
                EXPORT  IRQ085_Handler        [WEAK]
                EXPORT  IRQ086_Handler        [WEAK]
                EXPORT  IRQ087_Handler        [WEAK]
                EXPORT  IRQ088_Handler        [WEAK]
                EXPORT  IRQ089_Handler        [WEAK]
                EXPORT  IRQ090_Handler        [WEAK]
                EXPORT  IRQ091_Handler        [WEAK]
                EXPORT  IRQ092_Handler        [WEAK]
                EXPORT  IRQ093_Handler        [WEAK]
                EXPORT  IRQ094_Handler        [WEAK]
                EXPORT  IRQ095_Handler        [WEAK]
                EXPORT  IRQ096_Handler        [WEAK]
                EXPORT  IRQ097_Handler        [WEAK]
                EXPORT  IRQ098_Handler        [WEAK]
                EXPORT  IRQ099_Handler        [WEAK]
                EXPORT  IRQ100_Handler        [WEAK]
                EXPORT  IRQ101_Handler        [WEAK]
                EXPORT  IRQ102_Handler        [WEAK]
                EXPORT  IRQ103_Handler        [WEAK]
                EXPORT  IRQ104_Handler        [WEAK]
                EXPORT  IRQ105_Handler        [WEAK]
                EXPORT  IRQ106_Handler        [WEAK]
                EXPORT  IRQ107_Handler        [WEAK]
                EXPORT  IRQ108_Handler        [WEAK]
                EXPORT  IRQ109_Handler        [WEAK]
                EXPORT  IRQ110_Handler        [WEAK]
                EXPORT  IRQ111_Handler        [WEAK]
                EXPORT  IRQ112_Handler        [WEAK]
                EXPORT  IRQ113_Handler        [WEAK]
                EXPORT  IRQ114_Handler        [WEAK]
                EXPORT  IRQ115_Handler        [WEAK]
                EXPORT  IRQ116_Handler        [WEAK]
                EXPORT  IRQ117_Handler        [WEAK]
                EXPORT  IRQ118_Handler        [WEAK]
                EXPORT  IRQ119_Handler        [WEAK]
                EXPORT  IRQ120_Handler        [WEAK]
                EXPORT  IRQ121_Handler        [WEAK]
                EXPORT  IRQ122_Handler        [WEAK]
                EXPORT  IRQ123_Handler        [WEAK]
                EXPORT  IRQ124_Handler        [WEAK]
                EXPORT  IRQ125_Handler        [WEAK]
                EXPORT  IRQ126_Handler        [WEAK]
                EXPORT  IRQ127_Handler        [WEAK]
                EXPORT  IRQ128_Handler        [WEAK]
                EXPORT  IRQ129_Handler        [WEAK]
                EXPORT  IRQ130_Handler        [WEAK]
                EXPORT  IRQ131_Handler        [WEAK]
                EXPORT  IRQ132_Handler        [WEAK]
                EXPORT  IRQ133_Handler        [WEAK]
                EXPORT  IRQ134_Handler        [WEAK]
                EXPORT  IRQ135_Handler        [WEAK]
                EXPORT  IRQ136_Handler        [WEAK]
                EXPORT  IRQ137_Handler        [WEAK]
                EXPORT  IRQ138_Handler        [WEAK]
                EXPORT  IRQ139_Handler        [WEAK]
                EXPORT  IRQ140_Handler        [WEAK]
                EXPORT  IRQ141_Handler        [WEAK]
                EXPORT  IRQ142_Handler        [WEAK]
                EXPORT  IRQ143_Handler        [WEAK]
IRQ000_Handler
IRQ001_Handler
IRQ002_Handler
IRQ003_Handler
IRQ004_Handler
IRQ005_Handler
IRQ006_Handler
IRQ007_Handler
IRQ008_Handler
IRQ009_Handler
IRQ010_Handler
IRQ011_Handler
IRQ012_Handler
IRQ013_Handler
IRQ014_Handler
IRQ015_Handler
IRQ016_Handler
IRQ017_Handler
IRQ018_Handler
IRQ019_Handler
IRQ020_Handler
IRQ021_Handler
IRQ022_Handler
IRQ023_Handler
IRQ024_Handler
IRQ025_Handler
IRQ026_Handler
IRQ027_Handler
IRQ028_Handler
IRQ029_Handler
IRQ030_Handler
IRQ031_Handler
IRQ032_Handler
IRQ033_Handler
IRQ034_Handler
IRQ035_Handler
IRQ036_Handler
IRQ037_Handler
IRQ038_Handler
IRQ039_Handler
IRQ040_Handler
IRQ041_Handler
IRQ042_Handler
IRQ043_Handler
IRQ044_Handler
IRQ045_Handler
IRQ046_Handler
IRQ047_Handler
IRQ048_Handler
IRQ049_Handler
IRQ050_Handler
IRQ051_Handler
IRQ052_Handler
IRQ053_Handler
IRQ054_Handler
IRQ055_Handler
IRQ056_Handler
IRQ057_Handler
IRQ058_Handler
IRQ059_Handler
IRQ060_Handler
IRQ061_Handler
IRQ062_Handler
IRQ063_Handler
IRQ064_Handler
IRQ065_Handler
IRQ066_Handler
IRQ067_Handler
IRQ068_Handler
IRQ069_Handler
IRQ070_Handler
IRQ071_Handler
IRQ072_Handler
IRQ073_Handler
IRQ074_Handler
IRQ075_Handler
IRQ076_Handler
IRQ077_Handler
IRQ078_Handler
IRQ079_Handler
IRQ080_Handler
IRQ081_Handler
IRQ082_Handler
IRQ083_Handler
IRQ084_Handler
IRQ085_Handler
IRQ086_Handler
IRQ087_Handler
IRQ088_Handler
IRQ089_Handler
IRQ090_Handler
IRQ091_Handler
IRQ092_Handler
IRQ093_Handler
IRQ094_Handler
IRQ095_Handler
IRQ096_Handler
IRQ097_Handler
IRQ098_Handler
IRQ099_Handler
IRQ100_Handler
IRQ101_Handler
IRQ102_Handler
IRQ103_Handler
IRQ104_Handler
IRQ105_Handler
IRQ106_Handler
IRQ107_Handler
IRQ108_Handler
IRQ109_Handler
IRQ110_Handler
IRQ111_Handler
IRQ112_Handler
IRQ113_Handler
IRQ114_Handler
IRQ115_Handler
IRQ116_Handler
IRQ117_Handler
IRQ118_Handler
IRQ119_Handler
IRQ120_Handler
IRQ121_Handler
IRQ122_Handler
IRQ123_Handler
IRQ124_Handler
IRQ125_Handler
IRQ126_Handler
IRQ127_Handler
IRQ128_Handler
IRQ129_Handler
IRQ130_Handler
IRQ131_Handler
IRQ132_Handler
IRQ133_Handler
IRQ134_Handler
IRQ135_Handler
IRQ136_Handler
IRQ137_Handler
IRQ138_Handler
IRQ139_Handler
IRQ140_Handler
IRQ141_Handler
IRQ142_Handler
IRQ143_Handler
                B       .
                ENDP


                ALIGN


; User Initial Stack & Heap

                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap

__user_initial_stackheap PROC
                LDR     R0, =  Heap_Mem
                LDR     R1, =(Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem +  Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR
                ENDP

                ALIGN

                ENDIF


                END
